---
type: RevitAPIEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 4
tags: [revit-api, class]
---

# RevitAPIEventArgs

`Autodesk.Revit.DB.Events.RevitAPIEventArgs` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsCancelled | 2011 | `public bool IsCancelled ()` |
| Property | Cancellable | 2011 | `public bool Cancellable { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |